Catalogs/СпособыОтраженияРасходовПоАмортизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>СпособыОтраженияРасходовПоАмортизации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Способы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеОрганизации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СпособыОтраженияРасходовПоАмортизации/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Проверяет корректность заполнения элементов справочника при выполнении регламентной операции
//
// Параметры:
//  ОбъектРегламентнаяОперация - ДокументОбъект, ДокументСсылка
//  Отказ - Булево - Устанавливается Истина, если найдена ошибка
//  СпособыОтраженияРасходов - Массив - Перечень СправочникСсылка.СпособыОтраженияРасходовПоАмортизации, 
//                   которые следует проверить
Функция ПроверитьПриВыполненииРегламентнойОперации(ОбъектРегламентнаяОперация, Отказ, СпособыОтраженияРасходов) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	КонтрольЗатрат.СоздатьВременныеТаблицыСчетаГдеОбязательнаАналитика(МенеджерВременныхТаблиц);
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Параметры.Вставить("СпособыОтраженияРасходов", СпособыОтраженияРасходов);
	Запрос.УстановитьПараметр("ПустоеПодразделение", БухгалтерскийУчетПереопределяемый.ПустоеПодразделение());
	
	// Первый запрос пакета находит ошибки в составе правил (выбирает данные для поиска этих ошибок):
	// - ошибочно незаполненный счет затрат
	// - ошибочно незаполненные подразделения
	// - ошибочно незаполненные номенклатурные группы
	// - ошибочно незаполненные статьи затрат
	// Второй запрос находит ошибки в правиле:
	// - пустой состав
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоставПравила.Ссылка КАК Ссылка,
	|	СоставПравила.НомерСтроки,
	|	ВЫБОР
	|		КОГДА СоставПравила.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОшибкаСчетЗатрат,
	|	ВЫБОР
	|		КОГДА СчетаГдеОбязательныПодразделения.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОшибкаПодразделение,
	|	СоставПравила.СчетЗатрат,
	|	СчетаГдеОбязательныНоменклатурныеГруппы.НомерСубконто КАК НомерСубконтоОбязательныНоменклатурныеГруппы,
	|	СчетаГдеОбязательныСтатьиЗатрат.НомерСубконто КАК НомерСубконтоОбязательныСтатьиЗатрат,
	|	СоставПравила.Субконто1,
	|	СоставПравила.Субконто2,
	|	СоставПравила.Субконто3
	|ПОМЕСТИТЬ СоставПравил
	|ИЗ
	|	Справочник.СпособыОтраженияРасходовПоАмортизации.Способы КАК СоставПравила
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаГдеОбязательныПодразделения КАК СчетаГдеОбязательныПодразделения
	|		ПО СоставПравила.СчетЗатрат = СчетаГдеОбязательныПодразделения.Счет
	|			И (СоставПравила.ПодразделениеОрганизации = &ПустоеПодразделение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаГдеОбязательныНоменклатурныеГруппы КАК СчетаГдеОбязательныНоменклатурныеГруппы
	|		ПО СоставПравила.СчетЗатрат = СчетаГдеОбязательныНоменклатурныеГруппы.Счет
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаГдеОбязательныСтатьиЗатрат КАК СчетаГдеОбязательныСтатьиЗатрат
	|		ПО СоставПравила.СчетЗатрат = СчетаГдеОбязательныСтатьиЗатрат.Счет
	|ГДЕ
	|	СоставПравила.Ссылка В(&СпособыОтраженияРасходов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпособыОтраженияРасходовПоАмортизации.Ссылка КАК Ссылка,
	|	СпособыОтраженияРасходовПоАмортизации.Наименование КАК Наименование,
	|	ВЫБОР
	|		КОГДА СоставПравил.Ссылка ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОшибкаСостав,
	|	СоставПравил.НомерСтроки КАК НомерСтроки,
	|	СоставПравил.ОшибкаСчетЗатрат,
	|	СоставПравил.СчетЗатрат КАК СчетЗатрат,
	|	ПРЕДСТАВЛЕНИЕ(СоставПравил.СчетЗатрат),
	|	СоставПравил.ОшибкаПодразделение,
	|	СоставПравил.НомерСубконтоОбязательныНоменклатурныеГруппы,
	|	СоставПравил.НомерСубконтоОбязательныСтатьиЗатрат,
	|	СоставПравил.Субконто1,
	|	СоставПравил.Субконто2,
	|	СоставПравил.Субконто3
	|ИЗ
	|	Справочник.СпособыОтраженияРасходовПоАмортизации КАК СпособыОтраженияРасходовПоАмортизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ СоставПравил КАК СоставПравил
	|		ПО (СоставПравил.Ссылка = СпособыОтраженияРасходовПоАмортизации.Ссылка)
	|ГДЕ
	|	СпособыОтраженияРасходовПоАмортизации.Ссылка В(&СпособыОтраженияРасходов)
	|	И (СоставПравил.Ссылка ЕСТЬ NULL 
	|			ИЛИ СоставПравил.ОшибкаСчетЗатрат
	|			ИЛИ СоставПравил.ОшибкаПодразделение
	|			ИЛИ СоставПравил.НомерСубконтоОбязательныСтатьиЗатрат ЕСТЬ НЕ NULL 
	|			ИЛИ СоставПравил.НомерСубконтоОбязательныНоменклатурныеГруппы ЕСТЬ НЕ NULL )
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование,
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Непустой результат запроса - это не обязательно ошибки.
	// Потому что заполненность субконто проще проверять вне запроса
	
	Если РезультатЗапроса.Пустой() Тогда
		// Нет ошибок 
		Возврат Новый Массив;
	КонецЕсли;
	
	Ошибки = Новый Массив; // Будет содержать ссылки на способа отражения
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		// Добавляем в массив Ошибки после того, как убедились, что есть ошибка.
		
		Если Выборка.ОшибкаСостав Тогда
			
			// Сообщим об ошибке - не задан состав
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В способе отражения расходов по амортизации ""%1"" не указаны правила отнесения расходов.
							|Заполните способ отражения'"),
				Выборка.Наименование);
				
			ЗаписатьОшибкуПриВыполненииРегламентнойОперации(ТекстОшибки, Выборка.Ссылка, Отказ, ОбъектРегламентнаяОперация, Ошибки);
			
		ИначеЕсли Выборка.ОшибкаСчетЗатрат Тогда
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В способе отражения расходов по амортизации ""%1"" в строке %2 не заполнен счет затрат.
							|Устраните ошибку в способе отражения'"),
				Выборка.Наименование,
				Выборка.НомерСтроки);
			
			ЗаписатьОшибкуПриВыполненииРегламентнойОперации(ТекстОшибки, Выборка.Ссылка, Отказ, ОбъектРегламентнаяОперация, Ошибки);
			
		Иначе
			
			НеЗаполненаАналитика = Новый Массив;
			
			// Проверим заполнение аналитики в строке табличной части
			Если ЗначениеЗаполнено(Выборка.НомерСубконтоОбязательныНоменклатурныеГруппы) 
				И НЕ ЗначениеЗаполнено(Выборка["Субконто" + Выборка.НомерСубконтоОбязательныНоменклатурныеГруппы]) Тогда
				НеЗаполненаАналитика.Добавить("НоменклатурнаяГруппа");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.НомерСубконтоОбязательныСтатьиЗатрат) 
				И НЕ ЗначениеЗаполнено(Выборка["Субконто" + Выборка.НомерСубконтоОбязательныСтатьиЗатрат]) Тогда
				НеЗаполненаАналитика.Добавить("СтатьяЗатрат");
			КонецЕсли;
			
			Если Выборка.ОшибкаПодразделение = Истина Тогда // Обезопасимся от NULL
				НеЗаполненаАналитика.Добавить("Подразделение");
			КонецЕсли;
			
			Если НеЗаполненаАналитика.Количество() > 0 Тогда
			
				// Выводим сообщение об ошибке
				
				ТекстОшибки = НСтр("ru = 'В способе отражения расходов по амортизации ""[НазваниеСпособа]"" в строке [НомерСтроки] не [Заполнены] [Реквизиты] на счете [Счет].
	            |Заполните аналитику в способе отражения'");
				
				ПараметрыТекста = Новый Структура;
				ПараметрыТекста.Вставить("НазваниеСпособа", Выборка.Наименование);
	            ПараметрыТекста.Вставить("НомерСтроки",     Выборка.НомерСтроки);
	            ПараметрыТекста.Вставить("Счет",            Выборка.СчетЗатрат);
				
				СловаДляСклонения = Новый Структура;
				СловаДляСклонения.Вставить("Заполнены", Новый Структура("он,она,оно,они",НСтр("ru='заполнен'"),НСтр("ru='заполнена'"),НСтр("ru='заполнено'"),НСтр("ru='заполнены'")));
				КонтрольЗатрат.ДобавитьСклонениеВПараметрыСообщенияОбОшибке(ПараметрыТекста, НеЗаполненаАналитика, СловаДляСклонения); 
				
				// [Реквизиты]
				КонтрольЗатрат.ДобавитьПереченьАналитикиВПараметрыСообщенияОбОшибке(ПараметрыТекста, НеЗаполненаАналитика);
				
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ТекстОшибки,  ПараметрыТекста);
				
				ЗаписатьОшибкуПриВыполненииРегламентнойОперации(ТекстОшибки, Выборка.Ссылка, Отказ, ОбъектРегламентнаяОперация, Ошибки)
				
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЦикла; // По ВыборкаСпособов
	
	Возврат Ошибки;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Прочее

Процедура ЗаписатьОшибкуПриВыполненииРегламентнойОперации(ТекстОшибки, СпособОтражения, Отказ, ОбъектРегламентнаяОперация, Ошибки)
	
	// Сообщение об ошибке прервет выполнение операции
	БухгалтерскийУчетПереопределяемый.СообщитьОбОшибкеРегОперацииСНавигацией(ТекстОшибки, СпособОтражения, Отказ, ОбъектРегламентнаяОперация);
	
	Ошибки.Добавить(СпособОтражения);
	
КонецПроцедуры

#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") И ЗначениеЗаполнено(Параметры.Организация) Тогда
		Организации = Новый Массив;
		Организации.Добавить(Параметры.Организация);
		Организации.Добавить(Справочники.Организации.ПустаяСсылка());
		Параметры.Отбор.Вставить("Организация", Новый ФиксированныйМассив(Организации));
	КонецЕсли;
	
КонецПроцедуры
